[
    {
        "text" : "Лучшие программисты не чуть-чуть лучше хороших. Они на порядок лучше по любым меркам: концептуальное мышление, скорость, изобретательность и способность находить решения",
        "author" : "Рэндалл Стросс"
    },
    {
        "text" : "Опасайтесь багов в приведённом выше коде; я только доказал корректность, но не запускал его",
        "author" : "Дональд Эрвин Кнут"
    },
    {
        "text" : "Иногда лучше остаться спать дома в понедельник, чем провести всю неделю отлаживая написанный в понедельник код",
        "author" : "Кристофер Томпсон"
    },
    {
        "text" : "Измерять продуктивность программирования подсчётом строк кода - это так же, как оценивать постройку самолёта по его весу",
        "author" : "Билл Гейтс"
    },
    {
        "text" : "Сначала учите науку программирования и всю теорию. Далее выработаете свой программистский стиль. Затем забудьте всё и просто программируйте",
        "author" : "Джордж Карретте"
    },
    {
        "text" : "Большинство хороших программистов делают свою работу не потому, что ожидают оплаты или признания, а потому что получают удовольствие от программирования",
        "author" : "Линус Торвальдс"
    },
    {
        "text" : "Всегда пишите код так, будто сопровождать его будет склонный к насилию психопат, который знает, где вы живёте",
        "author" : "Мартин Голдинг"
    },
    {
        "text" : "Чтобы обнаруживать ошибки, программист должен иметь ум, которому доставляет удовольствие находить изъяны там, где, казалось, царят красота и совершенство",
        "author" : "Фредерик Брукс"
    },
    {
        "text" : "Есть лишь два вида языков программирования: те, на которые вечно жалуются, и те, которые никогда не используются",
        "author" : "Бьёрн Страуструп"
    },
    {
        "text" : "Каждый дурак может написать программу, которую может понять компьютер. Хороший программист пишет программу, которую может понять человек",
        "author" : "Мартин Фаулер"
    },
    {
        "text" : "Хуже программы, которая не работает, когда нужно, может быть только программа, которая работает, когда не нужно",
        "author" : "Боб Арчер"
    },
    {
        "text" : "Программирование - это искусство. ... Совершенные программы, отдельные приёмы программирования, удачные алгоритмы могут быть предметом коллекционирования и почитания",
        "author" : "Стивен Леви"
    },
    {
        "text" : "Программирование доставляет нам радость, потому что позволяет удовлетворить стремление к творчеству, глубоко заложенное в каждом из нас, и разделить это чувство радости с другими",
        "author" : "Фредерик Брукс"
    },
    {
        "text" : "Пессимисты, глядя на стакан, содержащий 50% воды и 50% воздуха, говорят, что он наполовину пуст. Оптимисты, наоборот, считают, что наполовину полон. А разработчики понимают, что просто сам стакан в два раза больше, чем должен быть",
        "author" : "Боб Льюис"
    }
]